public interface IBiomeIdentifier
{
}

public class BiomeIdentifier
{

}

public enum Biome
{
    /*
     *   濕潤  =寒帶=　　  =亞寒帶=　  =溫帶=　　  =亞熱帶=　　  =熱帶=
     *   高峰  [冰川　　]  [山地森林]  [山地森林]  [山地森林　]  [山地森林　]
     *   山地  [冰川　　]  [山地森林]  [山地森林]  [山地森林　]  [山地森林　]
     *   丘陵  [寒帶草原]  [針葉林　]  [混合林　]  [闊葉林　　]  [熱帶雨林　]
     *   土坡  [寒帶草原]  [針葉林　]  [混合林　]  [闊葉林　　]  [熱帶雨林　]
     *   平原  [寒帶草原]  [針葉林　]  [混合林　]  [闊葉林　　]  [熱帶雨林　]
     *   
     *   半濕  =寒帶=　　  =亞寒帶=　  =溫帶=　　  =亞熱帶=　　  =熱帶=
     *   高峰  [冰川　　]  [高山草原]  [高山草原]  [亞熱帶高原]  [熱帶高原　]
     *   山地  [冰川　　]  [高山草原]  [高山草原]  [亞熱帶高原]  [熱帶高原　]
     *   丘陵  [苔原　　]  [灌木林　]  [落葉林　]  [季風闊葉林]  [熱帶季風林]
     *   土坡  [苔原　　]  [灌木林　]  [落葉林　]  [季風闊葉林]  [熱帶季風林]
     *   平原  [苔原　　]  [灌木林　]  [落葉林　]  [季風闊葉林]  [熱帶季風林]
     *   
     *   半乾  =寒帶=　　  =亞寒帶=　  =溫帶=　　  =亞熱帶=　　  =熱帶=
     *   高峰  [冰川　　]  [高山草原]  [高山草原]  [亞熱帶高原]  [熱帶高原　]
     *   山地  [冰川　　]  [高山草原]  [高山草原]  [亞熱帶高原]  [熱帶高原　]
     *   丘陵  [苔原　　]  [溫帶草原]  [溫帶疏林]  [季風疏林　]  [熱帶莽原　]
     *   土坡  [苔原　　]  [溫帶草原]  [溫帶疏林]  [季風疏林　]  [熱帶莽原　]
     *   平原  [苔原　　]  [溫帶草原]  [溫帶疏林]  [季風疏林　]  [熱帶莽原　]
     *   
     *   乾燥  =寒帶=　　  =亞寒帶=　  =溫帶=　　  =亞熱帶=　　  =熱帶=
     *   高峰  [凍岩　　]  [荒岩　　]  [荒岩　　]  [焦岩　　　]  [焦岩　　　]
     *   山地  [凍岩　　]  [荒岩　　]  [荒岩　　]  [焦岩　　　]  [焦岩　　　]
     *   丘陵  [寒帶荒漠]  [溫帶礫漠]  [溫帶沙漠]  [亞熱帶沙漠]  [熱帶沙漠　]
     *   土坡  [寒帶荒漠]  [溫帶礫漠]  [溫帶沙漠]  [亞熱帶沙漠]  [熱帶沙漠　]
     *   平原  [寒帶荒漠]  [溫帶礫漠]  [溫帶沙漠]  [亞熱帶沙漠]  [熱帶沙漠　]
     */
}